Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་མིག་གི་འདུས་ཏེ་རེག་པ་མིག་གི་འདུས་ཏེ་རེག་པས་སྟོང་པའི་ཕྱིར་རོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: If you ask why, Subhūti, it is because visually compounded sensory contact is empty of visually compounded sensory contact, and because aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are empty of mentally compounded sensory contact [and so forth]. “

source: དཔེར་ན། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, just as the emptiness of feelings due to sensory contact that is visually compounded neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the emptiness of feelings due to sensory contact that is aurally compounded, the emptiness of feelings due to sensory contact that is nasally compounded, the emptiness of feelings due to sensory contact that is lingually compounded, the emptiness of feelings due to sensory contact that is corporeally compounded, and the emptiness of feelings due to sensory contact that is mentally compounded neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of feelings due to sensory contact that is visually compounded there is neither resting nor nonresting.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of feelings due to sensory contact that is aurally compounded, the essential nature of feelings due to sensory contact that is nasally compounded, the essential nature of feelings due to sensory contact that is lingually compounded, the essential nature of feelings due to sensory contact that is corporeally compounded, and the essential nature of feelings due to sensory contact that is mentally compounded there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བས་སྟོང་པའི་ཕྱིར་རོ། །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because feelings due to sensory contact that is visually compounded are empty of feelings due to sensory contact that is visually compounded, and because feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally compounded, and feelings due to sensory contact that is mentally compounded are empty of feelings due to sensory contact that is mentally compounded [and so forth]. “

source: རྨི་ལམ་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། སྒྲ་བརྙན་དང་།
en: Subhūti, just as dreams neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as magical displays, mirages, echoes, optical aberrations, reflections, and phantom emanations neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྨི་ལམ་གྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །སྒྱུ་མའི་ངོ་བོ་ཉིད་དང་། སྨིག་རྒྱུའི་ངོ་བོ་ཉིད་དང་།
en: If you ask why, Subhūti, in the essential nature of dreams there is neither resting nor nonresting.

source: སྒྲ་བརྙན་གྱི་ངོ་བོ་ཉིད་དང་། མིག་ཡོར་གྱི་ངོ་བོ་ཉིད་དང་། གཟུགས་བརྙན་གྱི་ངོ་བོ་ཉིད་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ། མི་གནས་པ་མེད་དོ།
en: In the essential nature of magical displays, the essential nature of mirages, the essential nature of echoes, the essential nature of optical aberrations, the essential nature of reflections, and the essential nature of phantom emanations of the tathāgatas, there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་རྨི་ལམ་རྨི་ལམ་གྱིས་སྟོང་པའི་ཕྱིར་རོ། །སྒྱུ་མ་སྒྱུ་མས་སྟོང་པའི་ཕྱིར་རོ། །སྨིག་རྒྱུ་སྨིག་རྒྱུས་སྟོང་པའི་ཕྱིར་རོ། །སྒྲ་བརྙན་སྒྲ་བརྙན་གྱིས་སྟོང་པའི་ཕྱིར་རོ། །མིག་ཡོར་མིག་ཡོར་གྱིས་སྟོང་པའི་ཕྱིར་རོ། །གཟུགས་བརྙན་གཟུགས་བརྙན་གྱིས་སྟོང་པའི་ཕྱིར་རོ། །དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because dreams are empty of dreams, magical displays are empty of magical displays, mirages are empty of mirages, echoes are empty of echoes, optical aberrations are empty of optical aberrations, reflections are empty of reflections, and phantom emanations of the tathāgatas are empty of phantom emanations of the tathāgatas. “

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Subhūti, just as the perfection of generosity neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of the perfection of generosity there is neither resting nor nonresting.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ།
en: In the essential natures of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom there is neither resting nor nonresting.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་པའི་ཕྱིར་རོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the perfection of generosity is empty of the perfection of generosity, and the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty of the perfection of wisdom [and so forth]. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ནང་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as the emptiness of internal phenomena neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of the emptiness of internal phenomena there is neither resting nor nonresting.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential natures of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ནང་སྟོང་པ་ཉིད་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because the emptiness of internal phenomena is empty of the emptiness of internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty of the emptiness of the essential nature of nonentities [and so forth]. “

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་།
en: Subhūti, just as the applications of mindfulness neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: If you ask why, Subhūti, in the essential nature of the applications of mindfulness there is neither resting nor nonresting.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential natures of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because the applications of mindfulness are empty of the applications of mindfulness, and the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty of the noble eightfold path [and so forth]. “

source: འཕགས་པའི་བདེན་པ་རྣམས་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: Subhūti, just as the truths of the noble ones neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འཕགས་པའི་བདེན་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: If you ask why, Subhūti, in the essential nature of the truths of the noble ones there is neither resting nor nonresting.

source: རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: In the essential natures of the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways there is neither resting nor nonresting.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་འཕགས་པའི་བདེན་པ་རྣམས། འཕགས་པའི་བདེན་པ་རྣམས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because the truths of the noble ones are empty of the truths of the noble ones, and the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty of the dhāraṇī gateways [and so forth]. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: Subhūti, just as the ten powers of the tathāgatas neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: དཔེར་ན། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of the ten powers of the tathāgatas there is neither resting nor nonresting.

source: །མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In the essential natures of the fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas there is neither resting nor nonresting.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because the ten powers of the tathāgatas are empty of powers of the tathāgatas, and the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty of distinct qualities of the buddhas [and so forth]. “

source: དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རང་སངས་རྒྱས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as arhats whose contaminants have ceased neither come to rest, nor do they not come to rest, and just as pratyekabuddhas neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དགྲ་བཅོམ་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of an arhat there is neither resting nor nonresting.

source: །རང་སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of a pratyekabuddha there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དགྲ་བཅོམ་པའི་ངོ་བོ་ཉིད། དགྲ་བཅོམ་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རང་སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད། རང་སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: If you ask why, Subhūti, it is because the essential nature of an arhat is empty of the essential nature of an arhat, and the essential nature of a pratyekabuddha is empty of the essential nature of a pratyekabuddha. “

source: དཔེར་ན། བྱང་ཆུབ་སེམས་དཔའ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as a bodhisattva neither comes to rest, nor does he not come to rest, and just as a tathāgata, arhat, completely awakened buddha neither comes to rest, nor does he not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of a bodhisattva there is neither resting nor nonresting.

source: །དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of a tathāgata there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ངོ་བོ་ཉིད། བྱང་ཆུབ་སེམས་དཔའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because the essential nature of a bodhisattva is empty of the essential nature of a bodhisattva, and the essential nature of a tathāgata is empty of the essential nature of a tathāgata. “

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རང་བྱང་ཆུབ་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the fruit of entering the stream to nirvāṇa neither comes to rest, nor does it not come to rest; just as [the fruits of] being destined for only one more rebirth, of no longer being subject to rebirth, and of arhatship neither come to rest, nor do they not come to rest; and just as individual enlightenment neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: If you ask why, Subhūti, in the essential nature of the fruit of entering the stream to nirvāṇa, there is neither resting nor nonresting.

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of [the fruits of] being destined for only one more rebirth, of no longer being subject to rebirth, and of arhatship there is neither resting nor nonresting.

source: །རང་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ་མི་གནས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In the essential nature of individual enlightenment there is neither resting nor nonresting.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ངོ་བོ་ཉིད། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །རང་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་རང་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: If you ask why, Subhūti, it is because the essential nature of the fruit of entering the stream to nirvāṇa is empty of the essential nature of the fruit of entering the stream to nirvāṇa; the essential natures of [the fruits of] being destined for only one more rebirth, of no longer being subject to rebirth, and of arhatship are empty of the essential nature of arhatship [and so forth]; and the essential nature of individual enlightenment is empty of the essential nature of individual enlightenment. “

source: དཔེར་ན། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as knowledge of the path neither comes to rest, nor does it not come to rest, and just as all-aspect omniscience neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.
